**Dataframe Notion**

In [4]:
import pandas as pd
import numpy as np

names = ["Ali", "Sonia", "Mohammed", "Salah", "Walid"]
employees = np.array([[2500,22], [2550,35], [2009,42], [2000,25], [1800,23]])

df_employees = pd.DataFrame([[2500,22], [2550,35], [2009,42], [2000,25], [1800,23]], index=[names], columns = ["Salary", "Age"])

df_employees

          Salary  Age
Ali         2500   22
Sonia       2550   35
Mohammed    2009   42
Salah       2000   25
Walid       1800   23

In [9]:
df_employees['Social Status'] = ['Single', 'Married', 'Single', 'Married', 'Single']

df_employees

          Salary  Age Social Status
Ali         2500   22        Single
Sonia       2550   35       Married
Mohammed    2009   42        Single
Salah       2000   25       Married
Walid       1800   23        Single

In [10]:
df_employees.shape

(5, 3)

In [11]:
df_employees.index

MultiIndex([(     'Ali',),
            (   'Sonia',),
            ('Mohammed',),
            (   'Salah',),
            (   'Walid',)],
           )

In [12]:
df_employees.columns

Index(['Salary', 'Age', 'Social Status'], dtype='object')

In [13]:
df_employees.dtypes

Salary            int64
Age               int64
Social Status    object
dtype: object

In [15]:
# using numeric indexes

df_employees.iloc[0,0]

2500

In [16]:
df_employees.iloc[-1,-1]

'Single'

In [17]:
# using labes
# get age of Sonia
# similar to SQL request: select age from df_employees where name = 'Sonia'

df_employees.loc['Sonia', 'Age']

Sonia    35
Name: Age, dtype: int64

In [18]:
# get all ages
df_employees.loc[:,'Age']

Ali         22
Sonia       35
Mohammed    42
Salah       25
Walid       23
Name: Age, dtype: int64

In [20]:
df_employees.Age

Ali         22
Sonia       35
Mohammed    42
Salah       25
Walid       23
Name: Age, dtype: int64

In [21]:
df_employees['Age']

Ali         22
Sonia       35
Mohammed    42
Salah       25
Walid       23
Name: Age, dtype: int64

In [19]:
# get all Sonia's data
df_employees.loc['Sonia',:]

       Salary  Age Social Status
Sonia    2550   35       Married

In [23]:
# get age of Sonia and Walid
df_employees.loc[['Sonia', 'Walid'], 'Age']

Sonia    35
Walid    23
Name: Age, dtype: int64

In [24]:
# get age and social status of Sonia and Walid
df_employees.loc[['Sonia', 'Walid'], ['Age', 'Social Status']]

       Age Social Status
Sonia   35       Married
Walid   23        Single

In [27]:
from datetime import datetime 

df_employees['Year Of Birth'] = datetime.now().year - df_employees['Age']

df_employees

          Salary  Age Social Status  Year Of Birth
Ali         2500   22        Single           2000
Sonia       2550   35       Married           1987
Mohammed    2009   42        Single           1980
Salah       2000   25       Married           1997
Walid       1800   23        Single           1999